# -*- coding: utf-8 -*-
"""Пример обработчика для модуля меню."""

# # Использование модулей Python
# В модуле приложения вы можете использовать модули Python, используемые
# в ShiroCore (loguru, tomli), а так же использовать утилиты из utils
# ! Автоматическая установка зависимостей пока в разработке
# Если модуль использует другие модули Python, например rich, их пока
# придётся устанавливать вручную

from loguru import logger

from utils.text import get_text

# ! Класс обработчика обязательно должен иметь название "Handler"
# Тем не менее, для индивидуальности всегда можно написать класс с любым
# названием, после чего унаследовать от него новый класс с таким именем.

# * Параметр "modules"
# Класс обработичка для модуля типа "menu" при инициализаци принимает список
# загруженных модулей в параметр modules. Это важно, ведь при запуске
# меню, приложение будет передовать его в виде: menu = Handler(modules=[])

# * Метод "show()"
# Класс обработчика должен иметь метод show(), который будет вызываться
# при запуске модуля. Без этого метода программа выдаст ошибку.


def t(text: str) -> dict | str:
    """"""
    return get_text(f"ExampleMenu.{text}")


class Handler:

    def __init__(self, modules: list) -> "Handler":
        """Инициализация меню.

        Args:
            modules (list): Список загруженных модулей.

        Returns:
            Handler: Объект обработчика.
        """
        self.__modules: list = modules

    def show(self) -> None:
        """Запуск работы модуля."""
        logger.trace("Запуск меню Example Menu.")  # Логирование

        # # Заголовок меню
        print(t("message"))

        # # Бесконечный цикл
        # Чтобы приложение не закрывалось после первого выполнения
        # Можно определить явный выход из меню, например, добавив в список
        # модулей дополнитльный обработчик, который будет осуществлять выход
        while True:

            # # Вывод списка доступных модулей для выполнения
            print(t("options.message"))
            for i, module in enumerate(self.__modules):
                text: str = t("options.option").format(
                    n=(i + 1), option=module().button
                )
                print(text)

            # # Ввод пользователя номера модуля для выполнения
            try:
                print(t("input.message"), end="")
                option: int = int(input())
            except Exception:
                print(t("input.error"))
                continue

            # # Выполнение модуля согласно выбора пользователя
            self.__modules[option - 1]().show()
