# -*- coding: utf-8 -*-
"""Пример обработчика для модуля."""

# # Использование модулей Python
# В модуле приложения вы можете использовать модули Python, используемые
# в ShiroCore (loguru, tomli), а так же использовать утилиты из utils
# ! Автоматическая установка зависимостей пока в разработке
# Если модуль использует другие модули Python, например rich, их пока
# придётся устанавливать вручную

from loguru import logger

from utils.text import get_text

# ! Класс обработчика обязательно должен иметь название "Handler"
# Тем не менее, для индивидуальности всегда можно написать класс с любым
# названием, после чего унаследовать от него новый класс с таким именем.

# * Свойство "buttons()"
# Обработчик должен иметь свойство "buttons", возвращающее строку.
# Эту строку будет выводить модуль меню приложения при выводе списка доступных
# опций пользователю.

# * Метод "show()"
# Класс обработчика должен иметь метод show(), который будет вызываться
# при запуске модуля. Без этого метода программа выдаст ошибку.


def t(text) -> str:
    return get_text(text=f"ExampleModule.{text}")


class Handler:

    @property
    def button(self) -> str:
        """Возвращает текст кнопки, отображаемой в меню приложения.

        Returns:
            str: Текст кнопки, отображаемой в меню приложения.
        """
        return t("button")

    def show(self) -> None:
        """Запуск работы модуля."""
        logger.trace("Запуск модуля Example Module.")  # Логирование

        # # Вывод модуля
        print(t("message"))

        # # Ожидание от пользователя корректного ввода
        # Для завершения работы модуля
        while True:
            print(t("input.message"), end="")
            result: str = input()
            if result == "Y":
                break
